admin@338
is
a
China-based
cyber
threat
group
It
has
previously
used
newsworthy
events
as
lures
to
deliver
malware
and
primarily
targeted
organizations
involved
in
financial
economic
trade
policy
typically
using
publicly
available
RATs
such
PoisonIvy
well
some
non-public
backdoors
actors
the
following
commands
exploitation
of
machine
with
LOWBALL
enumerate
user
accounts
net
>>
%temp%\download
/domain
Following
created
file
containing
list
be
executed
on
compromised
computer
exploited
client
software
vulnerabilities
for
execution
Microsoft
Word
CVE-2012-0158
after
exploiting
obtain
information
about
files
directories
dir
c\
c\Documents
Settings
c\Program
Files\
d\
Ajax
Security
Team
that
been
active
since
at
least
2010
believed
operating
out
Iran
By
2014
transitioned
from
website
defacement
operations
malware-based
espionage
campaigns
targeting
US
defense
industrial
base
Iranian
users
anti-censorship
technologies
FireMalv
custom-developed
which
collected
passwords
Firefox
browser
storage
Wrapper/Gholee
downloaded
additional
infected
system
CWoolger
MPK
recorded
all
keystrokes
an
personalized
spearphishing
attachments
APT-C-36
suspected
South
America
2018
The
mainly
targets
Colombian
government
institutions
important
corporations
sector
petroleum
industry
professional
manufacturing
embedded
VBScript
within
malicious
document
upon
opening
binary
data
specified
domain
opened
disguised
its
scheduled
tasks
those
by
Google
port
4050
C2
communications
APT12
attributed
China
variety
victims
including
but
not
limited
media
outlets
high-tech
companies
multiple
governments
variants
DNS
Calculation
multiplying
first
two
octets
IP
address
adding
third
octet
value
order
get
resulting
command
control
Office
CVE-2009-3129
Adobe
Reader
Flash
CVE-2009-4324
CVE-2009-0927
CVE-2011-0609
CVE-2011-0611
sent
emails
documents
PDFs
attached
attempted
open
PDF
attachment
via
APT18
operated
2009
range
industries
technology
human
rights
groups
medical
uses
HTTP
establishes
persistence
HKCU\Software\Microsoft\Windows\CurrentVersion\Run
key
cmd.exe
execute
APT19
Chinese-based
finance
energy
pharmaceutical
telecommunications
high
tech
education
legal
services
In
2017
phishing
campaign
was
target
seven
law
investment
firms
Some
analysts
track
Deep
Panda
same
it
unclear
source
if
are
also
variant
communicate
over
An
setting
Registry
HKCU\Software\Microsoft\Windows\CurrentVersion\Run\Windows
Debug
Tools-%LOCALAPPDATA%\
launched
code
SCT
PowerShell
payloads
Port
22
registers
itself
service
Base64
encode
server
decrypts
strings
single-byte
XOR
keys
performed
watering
hole
attack
forbes.com
compromise
-W
Hidden
conceal
windows
WindowStyle
parameter
hidden
legitimate
executable
loaded
DLL
modify
several
obfuscate
payload
RTF
XLSM
formats
initial
exploits
Regsvr32
bypass
application
techniques
APT28
Russia
General
Staff
Main
Intelligence
Directorate
GRU
85th
Special
Service
Center
GTsSS
military
unit
26165
This
2004
reportedly
Hillary
Clinton
Democratic
National
Committee
Congressional
Campaign
2016
attempt
interfere
U.S.
presidential
election
indicted
five
Unit
officers
associated
close-access
conducted
between
against
World
Anti-Doping
Agency
WADA
nuclear
facility
Organization
Prohibition
Chemical
Weapons
OPCW
Spiez
Swiss
Chemicals
Laboratory
other
these
were
assistance
74455
referred
Sandworm
CVE-2015-1701
access
SYSTEM
token
copy
into
current
process
part
privilege
escalation
registered
domains
imitating
NATO
OSCE
security
websites
Caucasus
resources
large-scale
scans
find
vulnerable
servers
SMTP
communication
channel
various
implants
initially
self-registered
Mail
later
email
Later
CHOPSTICK
use
blend
channels
depending
module
configuration
tool
gather
compress
DCCC
DNC
networks
deployed
copied
startup
directory
loader
Trojan
adds
HKCU\Environment\UserInitMprLogonScript
establish
can
perform
brute
force
attacks
credentials
brute-force/password-spray
tooling
modes
password-spraying
mode
approximately
four
authentication
attempts
per
hour
account
course
days
or
weeks
brute-force
300
hours
downloads
executes
scripts
performs
batch
script
run
macros
captures
air-gapped
computers
USB
transfers
network-connected
when
inserted
SharePoint
retrieved
internal
machines
inside
victim
environments
Forfiles
stage
before
exfiltration
backdoor
may
collect
entire
contents
device
added
junk
each
encoded
string
preventing
trivial
decoding
without
knowledge
removal
algorithm
Each
implant
given
length
tracked
controller
allow
seamless
prevent
analysis
protocol
wire
stored
captured
credential
named
pi.log
macro
certutil
-decode
decode
.txt
storing
base64
Exchange
installed
Delphi
custom
COM
hijacking
replacing
MMDeviceEnumerator
object
exfiltrate
Drive
SQL
injection
organizations'
external
vulnerability
CVE-2017-0262
CVE-2015-4902
features
CVE-2014-4076
CVE-2015-2387
CVE-2017-0263
escalate
privileges
Windows
SMB
Remote
Code
Execution
Vulnerability
conduct
lateral
movement
locate
Excel
during
collection
searched
specific
terms
harvested
login
saved
attributes
timestomping
cleared
event
logs
wevtutil
cl
System
intentionally
deleted
cover
their
tracks
program
CCleaner
first-stage
downloader
contact
second-stage
APT29
Foreign
SVR
They
have
2008
often
Europe
member
countries
research
institutes
think
tanks
starting
summer
2015
April
2021
UK
SolarWinds
supply
chain
operation
public
statements
included
citations
Cozy
Bear
Dukes
Victims
this
consulting
telecom
North
Asia
Middle
East
Industry
reporting
UNC2452
NOBELIUM
StellarParticle
Dark
Halo
bypassed
UAC
obtained
roles
Get-ManagementRoleAssignment
own
devices
allowed
IDs
sync
Set-CASMailbox
allowing
copies
mailboxes
permissions
Mail.Read
Mail.ReadWrite
Application
Principals
OAuth
Applications
algorithmically
generated
Twitter
handles
HAMMERTOSS
acquired
through
resellers
7-Zip
stolen
password-protected
archives
prior
Run
drops
shortcut
uploaded
CozyCar
installations
download
install
SeaDuke
create
new
remote
identify
settings
evade
defenses
developed
written
Python
they
Group
Managed
Account
gMSA
extracted
steganography
hide
images
staged
OWA
Raindrop
self-signed
digital
certificates
enable
mutual
TLS
SUNSPOT
SUNBURST
TEARDROP
tailored
incorporated
SolarWind
Orion
library
changed
federation
trust
Azure
AD
administrative
configure
accept
authorization
tokens
signed
SAML
signing
certificate
Get-AcceptedDomain
cmdlet
accepted
Management
Shell
AdFind
discover
federated
dynamic
resolution
construct
resolve
randomly-generated
subdomains
individuals
executives
IT
staff
New-MailboxExportRequest
followed
Get-MailboxExportRequest
sticky-keys
unauthenticated
privileged
console
WMI
subscriptions
exfiltrated
simple
HTTPS
request
archive
CVE-2019-19781
Citrix
CVE-2019-11510
Pulse
Secure
VPNs
CVE-2018-13379
FortiGate
CVE-2019-9670
Zimbra
gain
CVE-2020-0688
Control
Panel
regain
network
common
like
identities
tools
configured
virtual
Get-WebServicesVirtualDirectory
MFA
set
generating
cookie
secret
AUDITPOL
audit
netsh
firewall
rules
certain
UDP
outbound
packets
manager
disable
monitoring
products
removed
evidence
export
requests
Remove-MailboxExportRequest
temporarily
replaced
utilities
then
restored
original
routinely
once
achieved
SDelete
remove
artifacts
modified
timestamps
match
Cobalt
Strike
host
hostnames
infrastructure
environment
addresses
originating
country
VPN
renamed
version
sqlceip.exe
csrss.exe
appear
Server
Telemetry
Client
Runtime
Process
respectively
\Microsoft\Windows\SoftwareProtectionPlatform\EventCacheManager
TCP
UPX
pack
leveraged
replicate
controllers
APT3
researchers
Ministry
State
responsible
known
Operation
Clandestine
Fox
Wolf
Double
Tap
As
June
appears
shifted
political
Hong
Kong
MITRE
Adversary
Emulation
Plan
info
local
global
power
administrators
add
admin
maintain
elevated
exfilling
places
folder
password
hashes
able
leverage
plain
text
/C
whoami
systems
support_388945a0
creates
dump
browsers
will
single
location
replaces
Sticky
Keys
C\Windows\System32\sethc.exe
exfiltrates
looks
-WindowStyle
side
load
DLLs
valid
Chrome
one
delete
keylogging
records
encrypted
SOCKS5
connection
192.157.198103
1913
response
verified
192.184.60229
81
connections
obfuscates
help
defensive
measures
APT32
private
foreign
dissidents
journalists
strong
focus
Southeast
Asian
Vietnam
Philippines
Laos
Cambodia
extensively
strategic
web
compromises
Vietnam-based
enumerated
localgroup
up
Dropbox
Amazon
S3
JavaScript
communicates
attacker
controlled
frameworks
LZMA
compression
RC4
encryption
established
both
VBS
directly
scriptlets
beacons
PowerShell-based
one-liners
shellcode
loaders
drive-by
Services
ensure
tricking
them
visiting
Facebook
pages
tandem
fake
encoding
subdomain
field
already
C&C
includes
exploit
CVE-2017-11882
CVE-2016-7255
possesses
capability
macOS
changes
permission
wants
755
surveillance
activists
bloggers
e-mail
spyware
NTFS
alternate
streams
hides
clientID
chflags
function
ran
legitimately-signed
executables
Symantec
McAfee
side-loads
dropping
AcroTranscoder
task
raw
XML
backdated
timestamp
2
creation
time
dropped
second
kernel32.dll
Additionally
random
select
log
entries
receive
profile
visitors
abused
PasswordChangeNotify
monitor
capture
moving
laterally
beacon
Installer
NetCat
kb-10233.exe
masquerade
update
install_flashplayers.exe
non-printing
characters
names
appending
Unicode
no-break
space
character
name
impersonated
installer
install_flashplayer.exe
moved
pubprn.vbs
avoid
detection
store
scanning
search
ports
OS
finger-printing
view
show
shares
C$
ADMIN$
non-standard
e.g
14146
Invoke-Obfuscation
framework
obfuscation
called
Dont-Kill-My-Cat
DKMC
encrypts
AES-256
CBC
garbage
mislead
anti-malware
Outlook
VbaProject.OTM
APT33
carried
2013
across
United
States
Saudi
Arabia
Korea
particular
interest
aviation
sectors
WinRAR
exfil
DarkComet
Startup
spraying
utilized
initiate
delivery
LaZagne
traffic
AES
hosts
FTP
separately
CVE-2018-20250
CVE-2017-11774
CVE-2017-0213
programs
SniffPass
sniffing
808
880
Mimikatz
ProcDump
APT37
Korean
2012
Japan
Nepal
India
Romania
Kuwait
parts
linked
2016-2018
Daybreak
Erebus
Golden
Time
Evil
New
Year
Are
you
Happy
FreeMilk
Northern
Human
Rights
definitions
significant
overlap
Lazarus
encompass
broad
activity
refer
any
clusters
Bluenoroff
APT38
while
dropper
next
higher
audio
capturing
utility
SOUNDWAVE
microphone
input
HKCU\Software\Microsoft\CurrentVersion\Run\
command-line
interface
VBA
stealer
ZUMKONG
harvest
usernames
victims'
destructive
capable
overwriting
Master
Boot
Record
MBR
particularly
distribute
torrent
file-sharing
sites
more
indiscriminately
disseminate
Javascript
based
profiler
RICECURRY
accordingly
Player
CVE-2016-4117
CVE-2018-4878
CVE-2017-0199
DDE
financially-motivated
backed
regime
banks
than
16
13
QUICKRIDE
KEYLIME
clipboard
tunneler
NACHOCHEESE
give
shell
secure
make
unrecoverable
Hermes
ransomware
encrypt
AES256
DYEPACK.FOX
manipulate
accessed
traces
fraudulent
SWIFT
transactions
displayed
end
DYEPACK
messages
en
route
printer
alter
databases
APT39
cyberespionage
MOIS
front
company
Rana
Computing
travel
hospitality
academic
Africa
entities
considered
BITS
maintained
LNK
shortcuts
Ncrack
reveal
stealing
AutoIt
reconnaissance
line
scanner
python
actions
Smartftp
Password
Decryptor
decrypt
steal
aggregate
CAB
LoadAppInit_DLLs
SOFTWARE\Microsoft\Windows
NT\CurrentVersion\Windows
ability
mouse
movements
Mozilla
mfevtpse.exe
proxy
closely
mimicking
mfevtps.exe
CrackMapExec
BLUETORCH
post
drop
APT41
assessed
Chinese
state-sponsored
conducts
early
observed
healthcare
video
game
14
CVE-2020-10189
RAR
BITSAdmin
registry
HKLM\SOFTWARE\Microsoft\Windows
NT\CurrentVersion\Svchost
deploy
families
/c
machines.APT41
BEACON
/bin/pwd
User
Admin
StorSyncSvc
provide
Encryptor
RaaS
ransom
note
DGAs
change
monthly
sticky
Data
Protection
API
DPAPI
relies
tied
environmentally
keyed
RC5
derived
volume
serial
number
Zoho
ManageEngine
Desktop
Central
Delivery
Controllers
ADC
gateway
follow
CVE-2015-1641
CVE-2019-3396
online
billing/payment
third-party
provider
payment
Steam
community
page
fallback
mechanism
perhaps
return
architecture
related
side-loading
LD_PRELOAD
Winnti
RAT
clearing
deleting
Bash
histories
keylogger
GEARSHIFT
popular
anti-virus
GOODLUCK
storescyncsvc.dll
secondary
WIDETONE
subnets
share
Axiom
SMN
Though
distinct
differences
groups'
TTPs
forms
include
commingling
so
PNG
image
replacement
RDP
sessions
BlackTech
Taiwan
occasionally
buffer
overflow
Internet
Information
IIS
6.0
CVE-2017-7269
CVE-2014-6352
CVE-2015-5119
loading
giving
hardcoded
placing
right-to-left-override
filenames
Carbanak
refers
sometimes
FIN7
therefore
installs
Carbanaks
Harpy
backup
fails
rule
exceptions
svchost.exe
shared
Chimera
semiconductor
airline
/dom
Administrator
administrator
discovery
encapsulate
gzip
Linux
continuous
retrieval
memory
type
\\c$\Users\\Favorites\Links\Bookmarks
bar\Imported
From
IE*citrix*
bookmark
stuffing
DSInternals
Active
Directory
Command
designated
locally
nltest
/domain_trusts
relationships
\\c$\Users\\AppData\Local\Microsoft\Outlook*.ost
wmic
/node
call
cmd
c\Users\\\backup.pst
c\windows\temp\backup.pst
i\\\My
Documents\.pstcopy
OneDrive
SSH
listings
organization
previous
breaches
place
touch
date
stamp
deletion
remotely
onto
GoogleUpdate.exe
jucheck.exe
RecordedTV.ms
teredo.tmp
update.exe
msadcs1.exe
altered
NTLM
direct
calls
leveraging
Dumpert
-b
-e
-p
packed
Get.exe
scan
ranges
gathered
ntds.dit
specifically
NtdsAudit
cmsadcs.exe
NTDS.dit
-s
RecordedTV_pdmp.txt
--users-csv
RecordedTV_users.csv
ntdsutil
database
tasklist
processes
financially
motivated
intrusions
money
ATM
card
processing
Eastern
One
alleged
leaders
arrested
Spain
still
Reporting
indicates
there
links
tunneling
path
launch
registering
under
OLE
compound
obfuscated
powershell.exe
launching
toolkit
Threadkit
launches
.bat
Plink
tunnels
had
Microsofts
Equation
Editor
Explorer
CVE-2018-8174
CVE-2017-8570
CVE-2017-8759
increase
levels
github.com
sendspace.com
upload
downloading
open-source
SoftPerfect
Network
Scanner
URLs
pointing
CopyKittens
Israel
Turkey
Jordan
Germany
Wilted
Tulip
ZPP
.NET
ZIP
substitute
cipher
Empire
-w
-windowstyle
Caracal
Lebanese
GDGS
Bandook
suffixed
&&&
HKEY_USERS\Software\Microsoft\Windows\CurrentVersion\Run
would
complete
'Pictures'
serve
default
encrypting
spearphished
Whatsapp
Darkhotel
hotel
traveling
guests
peer-to-peer
sharing
mspaint.lnk
disk
decrypted
imports
iframes
portals
redirect
selected
3DES
CVE-2015-8651
patterns
RSA
.LNK
running
DarkHydrus
agencies
educational
heavily
leverages
carrying
Template
Injection
window
enter
Web
Query
.iqy
contained
attachedTemplate
technique
template
DarkVishnya
actor
2017-2018
attacked
8
region
distribution
Bunny
Raspberry
Pi
netbooks
inexpensive
laptops
connect
companys
many
intrusion
Anthem
Crew
WebMasters
KungFu
Kittens
PinkPanther
Black
Vine
attribution
writing
screen
updated
different
hash
values
Dragonfly
2011
A
similar
emerged
identified
2.0
There
debate
extent
sufficient
lead
being
separate
SWC
utilizing
kit
spearphising
placed
trojanized
installers
vendor
app
stores
Elderwood
Aurora
manufacturers
nongovernmental
NGOs
providers
delivered
zero-day
injecting
visited
endpoint
Ritsol
trojan
sophisticated
employs
overwrite
firmware
hard
drives
environmental
keying
functionality
drive
could
Evilnum
TerraTV
TeamViewer
instead
located
FIN10
extort
option
critical
FIN4
confidential
market
regarding
unique
do
infect
typical
persistent
rather
authorized
correspondence
POST
transmit
display
dialog
box
automatically
words
hacked
phish
likely
communicating
activities
hijacked
FIN5
personally
identifiable
restaurant
gaming
made
who
speak
Russian
automated
pull
back
results
GET5
Penetrator
look
hard-coded
save
FIN6
crime
sold
profit
underground
marketplaces
aggressively
point
sale
PoS
retail
Metasploits
named-pipe
impersonation
PsExec
NTDSGRAB
compressed
staging
substitution
0xAA
permutation
iterate
bind
submit
button
HARDTACK
SHIPBREAD
crack
offline
scripting
merchant
Metasploit
listener
move
built-in
querying
osql.exe
map
Structured
Language
NetBIOS
downloaders
FrameworkPOS
Comodo
code-signing
lure
To
Pastebin
Storage
content
automate
mid-2015
point-of-sale
portion
Combi
OPT
TXT
RunOnce
items
prompt
removable
shim
retrieves
spear
AdobeFlashSync
port-protocol
mismatches
53
80
443
8080
FIN8
Exfiltration
Batch
frequently
cleanup
Lateral
Movement
Credential
Access
aggregates
tunnel
CVE-2016-0167
tmp
prefetch
subsequent
variables
standard
stdin
arguments
harvests
Invoke-Mimikatz
Credentials
WCE
distributed
Kitten
nexus
Australia
verticals
oil
gas
engineering
ntuser.dat
UserClass.dat
Softerra
LDAP
browse
documentation
bookmarks
assets
forced
Perl
reverse
changing
KeePass
cloud
instances
Teams
mine
valuable
sensitive
KeyBase
Fortinet
PulseSecure
Palo
Alto
appliances
WizTree
endpoints
binaries
svhost
dllhost
lpupdate
NMAP
Frankenstein
January
2019
unknown
comes
actors'
piece
together
unrelated
components
gathering
username
adversary
series
base64-encoded
acted
stager
WinUpdate
prompts
Visual
Basic
deobfuscated
revealed
small
designed
communicated
byte
stream
AES-CBC
utilize
plugins
send
GALLIUM
high-profile
commonly
Taiwan-based
exclusive
assist
dumping
high-privileged
SAM
hive
multi-part
Recycle
Bin
shells
HTRAN
publicly-facing
Wildfly/JBoss
SoftEther
covertly
portqry.exe
winrar
debug
apparent
types
packers
ensured
widely-available
cases
and/or
subvert
antimalware
solutions
reg
hives
Gallmaker
December
WinZip
Group5
though
definite
connected
Syrian
opposition
holes
normally
themes
njRAT
NanoCore
Android
DroidJack
Malware
layers
watching
HAFNIUM
infectious
disease
contractors
leased
VPS
Covenant
Power
Set-OabVirtualDirectoryPowerShell
mailbox
granted
ASCII
MEGA
Higaisa
origins
however
Poland
nations
disclosed
spoofed
start-up
FakeTLS
session
runtime
16-byte
AES-128
officeupdate.exe
identifier
User-Agent
every
10
minutes
GUID
ipconfig
Honeybee
led
humanitarian
aid
Singapore
Argentina
Indonesia
Canada
August
recently
February
combination
NTWDBLIB.dll
cliconfg.exe
protections
temp.zip
%temp%
encodes
uploads
accomplished
-
--.txt
configures
ComSysApp
autostart
embeds
Several
supported
theres
COMSysApp
collects
Inception
governmental
throughout
WebDav
modifying
HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run\
plugin
Opera
Torch
Yandex
hunting
.pdf
.xls
.doc
CVE-2014-1761
CVE-2018-0802
listing
Indrik
Spider
Dridex
banking
served
updates
domain-controlled
BitPaymer
Ke3chang
REDACTED
RoyalCli
BS2005
IE
IWebBrowser2
RoyalDNS
mechanisms
Nwsapagent
enumeration
spwebmember
transferred
regained
eviction
corporate
solution
interaction
keyloggers
right-to-left
override
trick
executing
.scr
.exe
dumped
Kimsuky
Korean-based
September
focused
DPRK/nuclear-related
expanding
behind
Hydro
&
Nuclear
Co
spoof
trusted
parties
extensions
cookies
JScript
logging
Mac
portal
e-mails
HWP
C\Program
Files\Common
Files\System\Ole
DB\
mailing
auto-forward
association
mshta.exe
EGIS
CO
Ltd
pass
November
wiper
Sony
Pictures
Entertainment
Blockbuster
Novetta
correlates
reported
Flame
1Mission
Troy
DarkSeoul
Ten
Days
Rain
late
KillDisk
disk-wiping
casino
KiloAlfa
obtains
interactive
CreateProcessAsUserA
context
WhiskeyDelta-Two
contains
rename
act
points
hosted
Github
IndiaIndia
sends
title
KilaAlfa
reports
foreground
RomeoDelta
.zip
format
saves
Zlib
sample
saving
Start
menu
creating
rebooted
installing
SSP
center
around
permutations
weak
Destover-like
Powershell
themselves
heap
uploading
Window
form
mimics
method
evading
SSL
man-in-the-middle
decryption
%TEMP%
background
wallpaper
threatening
rendering
unbootable
Disk
Structure
Wipe
SHARPKNOT
overwrites
deletes
possessed
WhiskeyAlfa
64MB
mix
static
buffers
wipe
logical
finally
WhiskeyBravo
4.9MB
physical
WhiskeyDelta
132MB
1.5MB
RATANKBA
ADD
SUB
Another
XORs
Other
Caracachs
SierraBravo-Two
generates
message
newly
SierraAlfa
chosen
transmission
chooses
again
samples
extension
lists
gathers
Macro
dot
prefix
Finder
TangoDelta
terminate
disables
Event
Notification
Alerter
During
disabled
Defender
Guard
Various
modifies
incoming
entirely
ways
suicide
last
write
copying
calc.exe
mspaint.exe
Leafminer
business
Total
BruteForcer
Imecab
retrieving
MailSniper
keywords
desktop
another
Sobolsoft
extract
EML
scanned
Leviathan
uploader
LUNCHMONEY
adversary-controlled
presumably
HOMEFRY
.rtf
lookalike
branding
ssh
foothold
regsvr32
sign
attempting
click
Machete
Spanish-speaking
Latin
emphasis
Venezuela
generally
intelligence
units
compiled
main
blog
Magic
Hound
Iranian-sponsored
long
term
resource-intensive
dating
personnel
complex
social
read
boxes
authenticate
intended
hundreds
IRC
folders
personal
.PST
personas
spear-phishing
total/free
fixed
validate
75
determine
whether
wishes
menuPass
2006
Individual
members
MSS
Tianjin
Bureau
worked
Huaying
Haitai
Science
Technology
Development
Company
aerospace
maritime
biotechnology
globally
Japanese
managed
MSPs
mining
university
administration
csvde.exe
TAR
Csvde
pentesting
wmiexec.vbs
PowerSploit
inject
mounting
Robocopy
transfer
stages
MSP
UPPERCUT
ZeroLogon
CVE-2020-1472
HR
expense
meeting
memos
versions
PwDump6
decoded
decompressed
loggers
esentutl
true
masquerading
seen
Mofang
frequent
practice
May
conducting
Myanmar
automobile
weapons
ShimRat
required
receiving
Molerats
Arabic-speaking
politically-motivated
AppData
built
JS
BrowserPasswordDump10
decompresses
sources
MuddyWater
European
American
Activity
possibly
OneHub
native
cabinet
makecab.exe
KCU\Software\Microsoft\Windows\CurrentVersion\Run\SystemTextEncoding
POWERSTATS
randomly
relay
ScreenConnect
manage
screenshots
rundll32.exe
.dll
CMSTP.exe
INF
one-liner
check
Skype
connectivity
steals
link
Mustang
nonprofits
religious
non-governmental
Mongolia
Pakistan
among
others
HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run\AdobelmdyU
HTA
c\windows\temp
ORat
consumer
customized
PlugX
InstallUtil.exe
Beacon
systeminfo
arp
netstat
-ano
requiring
directing
Naikon
Sea
Peoples
Liberation
Armys
PLA
Chengdu
Military
Region
Second
Technical
Reconnaissance
BureauMilitary
Cover
Designator
78020
While
characteristics
APT30
exact
matches
RoyalRoad
builder
intel.wll
advfirewall
Night
Dragon
involving
subsequently
privately
extranet
where
infiltration
pass-the-hash
enticed
OilRig
international
chemical
largely
carries
relationship
primary
FireEye
assesses
works
behalf
details
contain
references
aligns
nation-state
interests
APT34
combined
due
confidence
admins
Trusted
Subsystem
QUADAGENT
OopsIE
logged
PICKPOCKET
VALUEVAULT
Manager
query
HKEY_CURRENT_USER\Software\Microsoft\Terminal
Client\Default
Putty
Protocol
CANDYKING
screenshot
CHM
hostname
/all
-an
sc
macro-enabled
Wocao
described
health
care
France
Kingdom
APT20
suggesting
possible
retrieve
archived
plaintext
spawned
py2exe
managers
injected
turn
child
Agent
support
hops
Tor
exit
nodes
queried
detect
recent
PuTTY
Impacket
smbexec.py
accessing
IPC$
ping
Invoke-Kerberoast
tickets
bruteforce
discovered
disks
hardware
manufacturer
model
checks
internet
purposes
intercept
two-factor
soft
found
Patchwork
definitively
circumstantial
suggests
pro-Indian
Indian
entity
diplomatic
Much
pasted
forums
tank
March
files'
C\
jobs
achieve
stealers
persisted
Meterpreter
.SCT
Scripts
\AppData\Local\Google\Chrome\User
Data\Default\Login
index
eventually
fictitious
CVE-2012-1856
CVE-2014-4114
matching
BADNEWS
PLATINUM
Intel®
AMT
Serial-over-LAN
SOL
Putter
61486
12th
PLAs
3rd
Department
GSD
ASEP
McUpdate
corresponding
Sophos
Anti-Virus
SAVAdminService.exe
SavService.exe
Droppers
consisting
bytes
0xA0
–
0xAF
aims
Express
msinm.exe
outlook.exe
iexplore.exe
firefox.exe
Rancor
entice
commmands
Rocke
Chinese-speaking
whose
objective
appeared
cryptojacking
cryptocurrency
rocke@live.cn
wallet
held
Researchers
detected
overlaps
Iron
Cybercrime
confirmed
issued
wget
curl
miner
UPX-packed
Menu
Folder
init.d
Python-based
spread
coinminer
systemd
tar.gz
Apache
Struts
Oracle
WebLogic
CVE-2017-10271
ColdFusion
CVE-2017-3066
libprocesshider
/etc/ld.so.preload
hook
libc
functions
uninstalled
antivirus
killed
block
cryptominers
/var/log/
filename
java
RTM
cybercriminal
interested
neighboring
RIG
SUNDOWN
kits
advertising
Yandex.Direct
Technologies
GTsST
October
2020
six
Ukrainian
electrical
worldwide
NotPetya
French
Olympic
Destroyer
Winter
Games
Organisation
Georgia
discovering
listed
M.E.Doc
mimic
reset
leasing
hosting
operational
planning
BCS-server
connects
VBScripts
harvesting
CredRaptor
BlackEnergy
component
Windows-based
Human-Machine
Interfaces
HTML
tags
defaced
15000
belonging
Georgian
non-government
Base64-encoded
received
Triple
DES
GZip
mobile
applications
corrupt
master
boot
record
disrupted
compromising
internal-only
PowerPoint
objects
crafted
TIFF
CVE-2013-3906
Dropbear
researched
supply-chain
most
notably
efforts
potential
identification
employee
technical
Parliament
official
preparation
Olympics
partner
PyeongChang
partnership
site
pushed
destroy
SetWindowsHookEx
avoided
naming
explorer.exe
intercepter-NG
sniff
Sharpshooter
noted
definitive
Rising
Sun
%Startup%\mssync.exe
Sidewinder
focusing
Afghanistan
paths
temporary
CVE-2020-0674
rekeywiz.exe
ActiveXObject
Silence
Their
reside
Ukraine
Belarus
Azerbaijan
Kazakhstan
Bank
Automated
Workstation
ATMs
HKLM\Software\Microsoft\Windows\CurrentVersion\Run
modules
WINWORD.exe
CreateProcess
ShellExecute
444
sending
variable
Farse6.1
lsass.exe
DOCX
Silent
Librarian
proprietary
universities
Members
affiliated
Iran-based
Mabna
Institute
behest
Islamic
Revolutionary
Corps
IRGC
spoofing
free
top
level
.TK
.ML
.GA
.CF
.GQ
auto
forwarding
Sowbug
bundled
*
*.docx
Suckfly
driven
5900
40
credential-dumping
TA459
operate
TA505
driving
trends
criminal
EmailStealer
communiate
wide
Locky
Jaff
Bart
Philadelphia
GlobeImposter
demand
fast
flux
mask
botnets
distributing
IPs
obscure
TinyMet
TA551
English
German
Italian
speakers
email-based
DGA
generate
clients
masked
dat
jpg
Turla
Russian-based
45
spanning
embassies
Heightened
in-house
Turlas
platform
RPC
impersonate
GitHub
local_update_check
HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Run
HKCU\Software\Microsoft\Windows
NT\CurrentVersion\Winlogon
predefined
commands/scripts
PSInject
IronPython
IronNetInjector
toolchain
JavaScript-based
WordPress
central
thumb
routine
pulls
salt
filter
Profile
Invoke-ReflectivePEInjection.ps1
reflectively
reflective
UPnP
proxies
surveys
check-in
checking
null
pipes
/DOMAIN
Domain
Computers
Servers
DC
indicate
kernel
off
Driver
Signature
Enforcement
gpresult
-a
nbtstat
-n
config
NBTscan
tracert
IPv4
table
GetTcpTable2
/svc
Whitefly
mostly
large
amounts
Singapores
largest
SingHealth
wait
CVE-2016-0051
unpatched
Vcrodat
Windigo
thousands
Unix
Ebury
spam
botnet
Despite
enforcement
intervention
creators
operators
continued
updating
left
OpenSSH
presence
Windshift
departments
6
VB6
register
URL
schemes
icons
MS
screensavers
revoked
floating
calculations
apps
Play
Store
Apple
App
BULL
DEX
anti-analysis
capabilities
ROCK
region-locked
MDM
profiles
iOS
tracking
ECB
Blowfish
hex
Further
launcher
icon
benign
ren
%temp%\upload
audiodg.exe
ver
acquire
CPU
MAC
JHUHUGIT
Koadic
denial
DDoS
Responder
Name
poisoning
hashed
teams
Wi-Fi
pineapples
signals
RTL
Test
HKCU\Software\Microsoft\Office
test\Special\Perf
regularly
deploys
ex
notification
mass
URL-shortener
bootkit
along
Downdelph
searching
does
necessary
instance
hop
acts
even
router
routed
UEFI
Unified
Extensible
Firmware
Interface
rootkit
LoJax
take
rundll32
C\Windows\twain_64.dll
Email
Gmail
Yahoo
weaponized
abusing
Once
gained
proceeded
management
role
assignments
clicking
zip
forward
3389
139
Netbios
445
enabling
full
outside
meek
fronting
destination
pipe
WinRM
scheduler
schtasks
manipulated
existing
returned
booted
Rundll32.exe
Ticket
Granting
TGS
Principle
Names
lifecycle
fsutil
might
GoldFinder
GET
redirectors
travels
Federation
FS
container
forged
enterprise
Kerberos
ticket
duo-sid
.lnk
malicous
facilitate
platforms
indicators
triggering
argument
dig
currently
enables
interacted
Shares
existence
/create
/tn
mysc
/tr
C\Users\Public\test.exe
/sc
ONLOGON
/ru
WINS
DHCP
verify
GetPassword_x64
Dumper
spreadsheet
Net
Windows'
persist
Scheduled
Task/Job
regsvr32.exe
scriptlet
dynamically
infection
PubPrn.vbs
bypassing
ePO
deployment
stood
numerous
articles
scraped
fingerprint
-anpo
tcp
way
successfully
lured
.hta
.vbe
times
day
Gpppassword
invalid
Tencent
Shenzhen
Limited
VirtualAlloc
WriteProcessMemory
CreateRemoteThread
Bluetooth
harvester
APIs
delivers
Freenki
injects
ROKRAT
BIOS
identifies
BOOTWRECK
render
inoperable
CLOSESHAVE
securely
clears
Sysmon
NESTEGG
CLEANTOAD
packing
methods
Themida
Enigma
VMProtect
Obsidium
understand
MAPMAKER
print
repacked
thwart
SOCK5
strains
employing
rdpwinst
mangement
ANTAK
ASPXSPY
RequireSigned
feature
ensures
only
Remexi
post-exploitation
RemCom
Non-sucking
NSSM
VMProtected
.chm
bootkits
TIDYELF
WINTERLOVE
CLASSFON
Monero
rootkits
non-gaming
production
widely
HIGHNOON
WMIEXEC
AmmyyAdmin
Viewer
VNC
employees
millions
dollars
ggldr
Apps
Script
Sheets
Forms
encapsulated
\\HKU\\SOFTWARE\Microsoft\Terminal
Client\Servers
\\HKU\\Software\Microsoft\Windows\CurrentVersion\Internet
queries
invoke
c\windows\temp\update.bat
/f
/st
fsinfo
vssadmin
shadows
sytesm
shadow
volumes
Ping
|
findstr
EST
quser
start
/t
\ip/hostname
phone
numbers
2FA
codes
SMS
Cleaver
Strong
Threat
2889
TG-2889
ARP
ASP.NET
keystroke
LinkedIn
photos
cache
Attachment
protected
Ammyy
preserve
lost
cmstp.exe
/s
/ns
C\Users\ADMINI~W\AppData\Local\Temp\XKNqbpzl.txt
AppLocker
odbcconf
collecting
took
makes
distributes
Pallas
controls
selective
infector
spreading
either
processor
adapter
virus
propagates
infecting
employed
just-in-time
sandbox
analyzed
ends
.Md5.exe
root
sandbox-related
libraries
5190
7900
listeners
4444
4445
31337
DameWare
Mini
Tasklist
net.exe
accessible
Derusbi
uncommon
needed
EVILNUM
compromrised
stagers
SplinterRAT
S4U
Task
factor
presented
Authentication
clean
maintains
FLIPSIDE
Essential
NetTools
build
e-commerce
kill.bat
Stealer
schemas
POSTs
CVE-2013-3660
CVE-2011-2005
CVE-2010-4398
kernel-level
psexec
mstdc
Bind
Reverse
job
advertisements
spearphish
fragmented
character-replacement
functionalities
Documents
recordings
legally
purchased
digitally
double-click
recording
activate
double
clicks
sandboxes
Docs
test
scope
credentials/context
dsquery
Spearphishing
Attachments
Links
Valid
Accounts
Persistence
spawn
WMIC
prodump
LSASS
Volume
Shadow
Copy
NTDS
Ngrok
SSHMinion
FRPC
Go
Proxy
TightVNC
Angry
Tasks
looking
/Create
/F
/SC
DAILY
/ST
0900
/TN
/TR
virtualization
templates
MSbuild
actor-created
prompted
VMWare
Virtualbox
Whizzimo
LLC
-oan
CVE-2021-26855
CVE-2021-26857
CVE-2021-26858
CVE-2021-27065
on-premises
installation
365
tenants
fully
qualified
FQDNs
publicly-accessible
tools--including
Nishang
PowerCat--onto
procdump
NTDS.DIT
SIMPLESEESHARP
SPORTSBALL
Chopper
ASPXSpy
CVE-2018-0798
Higaisas
2007
package
side-load
OINFO12.OCX
svchast.exe
padding
calculating
ID
service-based
parameters
CreateProcessAsUser
traverses
keyword
removes
reduce
gets
MaoCheng
signature
Systems
membership
chains
routers
%path%\ctfmonrn.dll
decoy
gsecdump
golden
turning
disabling
compilation
dates
defeat
anti-forensics
PHProxy
examine
associations
Nirsoft
sniffer
non-secure
protocols
Hangul
Processor
Win7Elevate
PHP
Dinosaur
PE
Package
TAINTEDSCRIBE
disguise
narrator
ordered
choose
basic
constant
0xA7
logged-in
WhiskeyAlfa-Three
0
shuts
down
HKCU
HKLM
present
SecureCRT
Terminal
RealVNC
UltraVNC
Radmin
mRemote
FileZilla
pcAnyware
keyHKEY_CURRENT_USER\Software\Bitcoin\Bitcoin-Qt
SierraCharlie
propagation
accesses
subset
stopped
MSExchangeIS
inaccessible
concealed
cards
gateways
subnet
enumerates
logged-on
destroying
wiping
Instrumentation
Command-line
Doppelgänging
deploying
shipping
transportation
offices
Western
BADFLICK
Scriptlets
C\Windows\Debug
C\Perflogs
SeDll
MSI
masqueraded
Acrobat
zipped
msiexec
overwrote
4443
stole
Controller
shortened
PowerShells
Pupy
GetModuleFileName
lstrcat
CreateFile
ReadFile
tcping.exe
probe
status
0x40
secretsdump.py
Ntdsutil
hollowing
RedLeaves
PSCP
atexec.py
Scheduler
nameservers
Providers
Shortcuts
persistently
msiexec.exe
Out1
Browser64
checked
ProgramData
Kasper
ESET
agency
DCOM
Daniel
Bohannons
csc.exe
compile
C#
temp.jpg
ConnectWise
RemoteUtilities
Normal.dotm
procdump64.exe
recipients
DOC
PPT
PPTX
XLS
XLSX
RECYCLE.BIN
legitimately
kill
objectives
reached
'adobeupdate.dat'
'OneDrive.exe'
hinder
/v
anti-spyware
XOR-encoded
section
cracked
Cain
Abel
ISMAgent
falls
unable
reach
KEYPUNCH
LONGWATCH
GOLDIRONY
tested
AV
evasion
Home
Page
roll
patch
protect
abuse
implementation
upgrade
socket
Xserver
webservers
recursive
Logs
forensic
investigation
enabled
Wdigest
1
CreateProcessA
nbtscan
NETBIOS
mounted
zlib
edited
suite
DCSync
Baidu
Software
Update
Monitor
QuasarRAT
microsoft_network.exe
crome.exe
Resiliency
effort
thinking
no
issues
runs
Crypto
Obfuscator
apparently
NDiskMonitor
letters
bugs
per-recipient
purpose
identifying
TaskScheduler
Program
Files
360
interfaces
rar.exe
vector
exposed
7001
Redis
51640
headers
break
unpackers
.c
GNU
Compiler
Collection
GCC
PID
TermsHost.exe
evaded
Notepad.exe
looked
known_hosts
cryptomining
cron
uname
-m
6789
ROT13
example
Invoke-PSImage
Sport
airport
plainpwd
dumps
hyperlinks
unwitting
revealing
interconnected
maliciously
release
electricity
breakers
EDRPOU
craft
credible
webshells
P.A.S
Webshell
supplied
accounting
diagram
useful
understanding
how
dedicated
unauthorized
tricked
resemble
trustworthy
senders
ECDH-P256
winmgmts\.\root\SecurityCenter2
hotfixes
fwmain32.exe
ProxyBot
allows
node
backconnect
Sock4\Socks5
Nmap
topology
RAdmin
workstations
Silence.Downloader
aka
TrueBot
Winexe
forwarded
searches
Let
Encrypt
SingleFile
HTTrack
adobecms.exe
CSIDL_APPDATA\microsoft\security
winword.exe
Thawte
Sectigo
.iso
For
filters
consumers
WebDAV
4shared
VBoxDrv.sys
driver
locations
Recent
lPH*.dll
pattern
AMSI
patches
in-memory
amsi.dll
to/from
subverting
salted
Out-EncryptedScript.ps1
Based
comparison
Gazer
IoCs
mutex
Admins
Administrators
featuring
seemingly
Adobe.com
engage
calendar
